In [8]:
import numpy as np

In [9]:
import pandas as pd

In [14]:
d = {'A':[1,2,np.nan] , 'B':[5, np.nan, np.nan] , 'C':[1,2,3] }

In [15]:
df = pd.DataFrame(d)

In [16]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [18]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [19]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [20]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [21]:
#by default axis is 0

In [22]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [23]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [24]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [25]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [27]:
df['A'].mean()

1.5

In [26]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64